Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: Now you have a list of the remote references and SHAs.
es: A partir de ahi, ya tienes una lista de las referencias remotas y sus SHAs.

source: If you create a simple branch name based on the theme of the work you’re going to try, such as `ruby_client` or something similarly descriptive, you can easily remember it if you have to abandon it for a while and come back later.
es: Si creas los nombres de ramas basandolos en el tema sobre el que vas a trabajar, por ejemplo 'ruby client' o algo así de descriptivo, podrás recordar de qué iba cada rama en caso de que la abandones por un tiempo y la retomes más tarde.

source: If the update script exits non-zero, only that reference is rejected; other references can still be updated.
es: Si el script 'update' termina con un código de salida distinto de cero, únicamente los cambios de esa rama son rechazados; el resto de ramas continuarán con sus actualizaciones.

source: If the server you’re running it on is inside your firewall, you might use it for projects that a large number of people or computers (continuous integration or build servers) have read-only access to, when you don’t want to have to add an SSH key for each.
es: Si lo estás utilizando en un servidor dentro del perímetro de tu cortafuegos, puedes utilizarlo para proyectos donde un gran número de personas o de ordenadores (integración contínua o servidores de desarrollo) necesiten acceso de solo lectura. Y donde quieras evitar la gestión de claves SSH para cada una de ellas.

source: If you want to delete your `serverfix` branch from the server, you run the following:
es: Por ejemplo, si quieres borrar la rama 'serverfix' del servidor, puedes utilizar:

source: ### A SHORT NOTE ABOUT SHA-1 ###
es: ### Un breve comentario sobre los códigos SHA-1 ###

source: Then, you can merge those changes back into your master branch.
es: Tras lo cual, es posible fusionar esos cambios de vuelta a la rama 'master'.

source: You’ll build client scripts that help the developer know if their push will be rejected and server scripts that actually enforce the policies.
es: Para ello, has de preparar los correspondientes scripts de cliente (para ayudar a los desarrolladores a saber de antemano si sus envios van a ser rechazados o no), y los correspondientes scripts de servidor (para obligar a cumplir esas políticas).

source: The main difference is that a tag object points to a commit rather than a tree.
es: Su principal diferencia reside en que apunta a una confirmación de cambios (commit) en lugar de a un árbol (tree).

source: You may use it in conjunction with a commit template to programmatically insert information.
es: Se puede utilizar combinandolo con una plantilla de confirmación, para poder insertar información automáticamente.

source: I’ll use path names in the examples that work on Mac and Linux systems; for Windows, you’ll have to change `/usr/local/bin` to an executable path in your environment.
es: Los nombres de carpetas que utilizaré en los ejemplos funcionan en sistemas Mac y Linux; para Windows, tendrás que sustituir '/usr/local/bin' por el correspondiente camino al ejecutable en tu sistema.

source: The workflow required in order to contribute to a project is much different if you have write access to the project than if you don’t.
es: La forma de trabajar y de contribuir a un proyecto es totalmente diferente dependiendo de si tienes o no acceso de escritura al proyecto.

source: If you run `git add` with the `-i` or `--interactive` option, Git goes into an interactive shell mode, displaying something like this:
es: Al lanzar el comando 'git add' con las opciones '-i' o '--interactive', Git entra en un modo interactivo y muestra algo así como:

source: It also handles file adds, deletes, and renames if they’re described in the `git diff` format, which `patch` won’t do.
es: Además, es capaz de manejar adicciones, borrados o renombrados de archivos, si vienen en formato 'git diff'. Mientras que 'patch' no puede hacerlo.

source: However, that result is of limited use.
es: Pero esto tiene un uso bastante limitado.

source: As long as each user can get shell access on the machine, any SSH authentication mechanism you can think of should work.
es: Tan solo con que cada usuario pueda tener acceso al shell de la máquina, es válido cualquier mecanismo de autentificación SSH que se emplee para ello.

source: ### Tags ###
es: ### Etiquetas ###

source: In some contexts, the first line is treated as the subject of an email and the rest of the text as the body.
es: En algunos contextos, la primera línea se tratará como si fuera el asundo de un correo electrónico y el resto del texto como si fuera el cuerpo.

source: At this point, other users who have SSH access to the same server which has read-access to the `/opt/git` directory can clone your repository by running
es: A partir de entonces, cualquier otro usuario con acceso de lectura SSH a la carpeta '/opt/git' del servidor, podrá clonar el repositorio con la orden:

source: To do this, you can add the `commit-msg` hook.
es: Para ello, se añade el enganche 'commit-msg'.

source: You can do so with the `sed` command on Unix systems:
es: En los sistemas Unix, lo puedes realizar con el comando 'sed':

source: You can also set these values by manually editing the file and inserting the correct syntax, but it’s generally easier to run the `git config` command.
es: También puedes ajustar estas configuraciones manualmente, editando directamente los archivos correspondientes y escribiendo en ellos con la sintaxis correspondiente; pero suele ser más sencillo hacerlo siempre a través del comando 'git config'.

source: Assuming you saved the patch at `/tmp/patch-ruby-client.patch`, you can apply the patch like this:
es: Suponiendo que has guardado el parche en '/tmp/patch-ruby-client.patch', puedes incorporarlo con una orden tal como:

source: If your IMAP server doesn’t use SSL, the last two lines probably aren’t necessary, and the host value will be `imap://` instead of `imaps://`.
es: Las dos últimas líneas probablente no sean necesarias si tu servidor IMAP no utiliza SSL; y, en ese caso, el valor para `host` deberá de ser `imap://` en lugar de `imaps://`.

source: In the default case that is automatically written by a `git remote add` command, Git fetches all the references under `refs/heads/` on the server and writes them to `refs/remotes/origin/` locally.
es: En el caso por defecto en que es escrito por un comando `git remote add`, Git recupera del servidor todas las referencias bajo `refs/heads/`, y las escribe localmente en `refs/remotes/origin/`.

source: If you pass the option `--system` to `git config`, it reads and writes from this file specifically.
es: Con la opción '--system' del comando 'git config', puedes leer y escribir de/a este archivo.

source: If you mistype a command in Git 1.6, it shows you something like this:
es: Cada vez que tienes un error de tecleo en un comando, Git 1.6 te muestra algo como:

source: You do this by running the `gitosis-init` command with your personal public key.
es: Lo puedes hacer lanzando el comando 'gitosis-init' con tu clave pública personal.

source: Let’s see why you should do so.
es: Y vamos a ver el por qué merece la pena hacerlo así.

source: or you can edit your `~/.gitconfig` file to add these lines:
es: o puedes editar tu archivo '~/.gitconfig' para añadirle las siguientes lineas:

source: At this point, you have to merge this work in again, even though you’ve already done so.
es: En ese momento, tu te ves obligado a fusionar (merge) tu trabajo de nuevo, aunque creias que ya lo habias hecho antes.

source: To begin, you’ll set up external wrapper scripts to run your commands.
es: Para empezar, tienes que preparar los correspondientes scripts para lanzar tus comandos.

source: With these tools, you can much more easily let Git know what commit or commits you want to inspect.
es: Con estas herramientas, es mucho más sencillo indicar con precisión cual o cuales son las confirmaciones de cambios que se desean revisar.

source: Insert 18333fig0517.png Figure 5-17.
es: Insert 18333fig0517.png Figura 5-17.

source: In newer versions of Git (beginning with version 1.6.1), you can set `receive.denyDeletes` to true:
es: En las últimas versiones de Git (a partir de la 1.6.1), se puede evitar poniendo a 'true' el parámetro 'receive.denyDeletes':

source: Conceptually, the data that Git is storing is something like Figure 9-1.
es: Conceptualmente, la información almacenada por Git es algo similar a la Figura 9-1.

source: When you run `git init` in a new or existing directory, Git creates the `.git` directory, which is where almost everything that Git stores and manipulates is located.
es: Cuando lanzas 'git init' sobre una carpeta nueva o sobre una ya existente, Git crea la carpeta auxiliar '.git'; la carpeta donde se ubica prácticamente todo lo almacenado y manipulado por Git.

source: That is a special mode in Git that basically means you’re recording a commit as a directory entry rather than a subdirectory or a file.
es: Este es un modo especial de Git, un modo en el que la confirmación de cambio se almacena como una carpeta en lugar de como una subcarpeta o un archivo.

source: You have three trees that specify the different snapshots of your project that you want to track, but the earlier problem remains: you must remember all three SHA-1 values in order to recall the snapshots.
es: Tienes tres árboldes que representan diferentes momentos interesantes de tu proyecto, pero el problema principal sigue siendo el estar obligado a recordar los tres valores SHA-1 para poder recuperar cualquiera de esos momentos.

source: If you want Git instead to pull down only the `master` branch each time, and not every other branch on the remote server, you can change the fetch line to
es: Si, en cambio, quisieras hacer que Git recupere únicamente la rama `master` y no cualquier otra rama en el servidor remoto. Puedes cambiar la linea de recuperación a

source: ### Ancestry References ###
es: ### Referencias a ancestros ###

source: Insert 18333fig0519.png Figure 5-19.
es: Insert 18333fig0519.png Figura 5-19.

source: In the next few sections, you’ll see how to expand to more sophisticated setups.
es: En los siguientes apartados, se mostrará como ir más allá y preparar disposiciones más sofisticadas.

source: To see the last commit on each branch, you can run `git branch –v`:
es: Para ver la última confirmación de cambios en cada rama, puedes usar el comando 'git branch -v':

source: Gitosis can also control which projects GitWeb shows.
es: También podemos controlar a través de Gitosis los proyectos a ser mostrados por GitWeb.

source: The `Author` information is the individual who originally created the patch and when it was originally created.
es: El campo 'Author' muestra la persona que ha creado originalmente el parche y cuándo fue creado este.

source: In other words, in this case, you don’t have a new `serverfix` branch — you only have an `origin/serverfix` pointer that you can’t modify.
es: En otras palabras, en este caso, no tienes una nueva rama 'serverfix'. Sino que únicamente tienes un puntero no editable a 'origin/serverfix'.

source: If you clone from this, Git automatically names it `origin` for you, pulls down all its data, creates a pointer to where its `master` branch is, and names it `origin/master` locally; and you can’t move it.
es: Si haces un clón desde ahí, Git automáticamente lo denominará 'origin', traerá (pull) sus datos, creará un apuntador hacia donde esté en ese momento su rama 'master', denominará la copia local 'origin/master'; y será inamovible para tí.

source: ### Server Configuration ###
es: ### Configuración de Servidor ###

source: ### Forking Projects ###
es: ### Bifurcando proyectos ###

source: For example, suppose you have a project that looks like Figure 5-26.
es: Por ejemplo, suponiendo que tienes un proyecto parecido al ilustrado en la Figura 5-26.

source: Next you need to turn your shell back on for the 'git' user, if you changed it to the `git-shell` command.
es: A continuación, restaura el inicio de sesión (shell) para el usuario 'git', (si es que lo habias cambiado al comando 'git-shell').

source: You can also use the refspec to delete references from the remote server by running something like this:
es: Se pueden utilizar las referencias (refspec) para borrar en el servidor remoto. Por ejemplo, lanzando algo como:

source: She creates a new branch for the feature and does some work on it there:
es: Crea una nueva rama para dicha funcionalidad y trabaja en ella:

source: The Linux kernel also has a non-commit-pointing tag object — the first tag created points to the initial tree of the import of the source code.
es: El kernel de Linux tiene también un objeto tipo etiqueta apuntando a un objeto que no es una confirmación de cambios (commit). La primera etiqueta que se creó es la que apunta al árbol (tree) inicial donde se importó el código fuente.

source: That drops you into your text editor, which has your last commit message in it, ready for you to modify the message.
es: Mediante este comando, el editor de textos arranca con el mensaje escrito en la última confirmación de cambios; listo para ser modificado.

source: Git allows you to do this by using either the `^` character or `--not` before any reference from which you don’t want to see reachable commits.
es: Git permite realizar esto utilizando o bien el caracter `^` o bien la opción `--not` por delante de aquellas referencias de las que se desea no ver las confirmaciones de cambio.

source: The other main ancestry specification is the `~`.
es: Otra forma de referirse a los ancestros es la marca `~`.

source: Let’s switch to the new testing branch:
es: Hagamos una prueba, saltando a la rama 'testing' recién creada:

source: The other important difference is the way you get a listing of the files that have been changed.
es: La segunda diferencia es la forma de listar los archivos modificados.

source: The majority of the options are client side—configuring your personal working preferences.
es: La mayoria de las opciones están en el lado cliente, --configurando tus preferencias personales de trabajo--.

source: This can be a huge problem when you’re converting Subversion or Perforce repositories into Git.
es: Esto suele dar bastantes problemas cuando estás convirtiendo repositorios de Subversion o de Perforce a Git.

source: If you want to run the web interface on a server all the time for your team or for an open source project you’re hosting, you’ll need to set up the CGI script to be served by your normal web server.
es: Si quieres disponer permanentemente de un interface web para tu equipo o para un proyecto de código abierto que alberges, necesitarás ajustar el script CGI para ser servido por tu servidor web habitual.

source: If you look at the `gitosis.conf` file, it should only specify information about the `gitosis-admin` project that you just cloned:
es: Si miras dentro del archivo 'gitosis.conf', encontrarás únicamente información sobre el proyecto 'gitosis-admin' que acabas de clonar:

source: This opens a vast range of workflow possibilities for your project and/or your team, so I’ll cover a few common paradigms that take advantage of this flexibility.
es: Esto abre un enorme rango de posibles formas de trabajo en tu proyecto y/o en tu equipo. Aquí vamos a revisar algunos de los paradigmas más comunes diseñados para sacar ventaja a esta gran flexibilidad.

source: Figure 3-8 shows the result.
es: La Figura 3-8 muestra el resultado.

source: The Git protocol is far more efficient and thus faster than the HTTP protocol, so using it will save your users time.
es: El protocolo Git es mucho más eficiente y, por tanto, más rápido que el protocolo HTTP. Utilizándolo, ahorrarás mucho tiempo a tus usuarios.

source: Last we have the HTTP protocol.
es: Por último, tenemos el protocolo HTTP.

source: All you have to do is switch back to your master branch.
es: Basta con saltar de nuevo a la rama 'master' y continuar trabajando a partir de ella.

source: To enable a hook script, put a file in the `hooks` subdirectory of your Git directory that is named appropriately and is executable.
es: Para activar un punto de enganche para un script, pon el archivo correspondiente en la carpeta 'hooks'; con el nombre adecuado y con la marca de ejecutable.

source: You should have a pretty good understanding of what Git does in the background and, to some degree, how it’s implemented.
es: A estas alturas deberias tener una idea bastante clara de como trabaja Git entre bastidores. Y, hasta cierto punto, sobre cómo está implementado.

source: In this case, your development history has diverged from some older point.
es: En este caso, el registro de desarrollo habia divergido en un punto anterior.

source: Take the contents of the public key of that pair, and paste it into the SSH Public Key text box.
es: Pero, si ya tienes un par de claves SSH, puedes coger el contenido correspondiente a la clave pública y pegarlo en la caja de texto preparada para tal fin.

source: To set up a local branch with a different name than the remote branch, you can easily use the first version with a different local branch name:
es: Para preparar una rama local con un nombre distinto a la del remoto, puedes utilizar:

source: Finally, the server responds with a success (or failure) indication:
es: Y, por ultimo, el servidor responde con un indicador de éxito (o fracaso) de la operación:

source: ## Subtree Merging ##
es: ## Fusión de subárboles ##

source: Fetch more commits, and merge them into your work.
es: Traer (fetch) algunas confirmaciones de cambio (commits) y fusionarlas (merge) sobre tu trabajo.

source: Now that you’re here, let’s get started.
es: Y, ahora que estamos aquí, comencemos con el tema.

source: This may be a bit confusing, so let’s look at an example.
es: Esto puede ser un tanto confuso, pero intentemos aclararlo con un ejemplo.

source: Your iss53 branch can move forward independently.
es: La rama 'iss53' puede avanzar independientemente.

source: However, there are other strategies you can choose as well.
es: Pero existen también otras estratégias que se pueden escoger según se necesiten.

source: If you go back to an earlier example from the Merge section (see Figure 3-27), you can see that you diverged your work and made commits on two different branches.
es: Volviendo al ejemplo anterior, en la sección sobre fusiones (ver Figura 3-27), puedes ver que has separado tu trabajo y realizado confirmaciones (commit) en dos ramas diferentes.

source: Chapter 6 describes a number of useful Git tricks for rewriting history and interactively staging files — use these tools to help craft a clean and understandable history.
es: El Capítulo 6 contiene un gran número de trucos para reescribir el historial e ir preparando archivos interactivamente --utilizalos para ayudarte a crear un claro y comprensible historial--.

source: If you don’t have write access, how does the project prefer to accept contributed work?
es: Si no tienes acceso de escritura, ¿cuál es el sistema preferido del proyecto para aceptar contribuciones?.

source: This hook takes a few options: the path to the file that holds the commit message so far, the type of commit, and the commit SHA-1 if this is an amended commit.
es: Este punto de enganche recibe varias entradas: la ubicación (path) del archivo temporal donde se almacena el mensaje de confirmación, el tipo de confirmación y la clave SHA-1 si estamos enmendando un commit existente.

source: For now, move the `authorized_keys` file out of the way:
es: Para empezar, mueve el archivo 'authorized_keys a otro lado:

source: All the content is stored as tree and blob objects, with trees corresponding to UNIX directory entries and blobs corresponding more or less to inodes or file contents.
es: Todo el contenido se guarda como objetos arbol (tree) u objetos binarios (blob). Correspondiendo los árboles a las entradas de carpetas; y correspondiendo los binarios, mas o menos, a los contenidos de los archivos (inodes).

source: You must indicate how far back you want to rewrite commits by telling the command which commit to rebase onto.
es: La profundidad en la historia a modificar vendrá dada por la confirmación de cambios (commit) que se indique al comando.

source: # Git Tools #
es: # Las herramientas de Git #

source: #### Committing-Workflow Hooks ####
es: #### Puntos en el flujo de trabajo de confirmación de cambios ####

source: The general sequence is something like that shown in Figure 5-11.
es: La secuencia general es algo así como la mostrada en la Figura 5-11.

source: If you want to use subprojects in your project, you’ve learned a few ways to accommodate those needs.
es: En caso de requerir tener subproyectos dentro de un proyecto principal, se han visto unos cuantos caminos para resolver este requerimiento.

source: Your commit history with multiple topic branches.
es: El registro de confirmaciones con múltiples ramas puntuales.

source: The downside of the Git protocol is the lack of authentication.
es: La pega del protocolo Git, es su falta de autentificación.

source: Creating a new branch pointer.
es: Creación de un apuntador a la nueva rama.

source: By convention, bare repository directories end in `.git`, like so:
es: Por convenio, los nombres de los repositorios básicos suelen terminar en '.git', por lo que lanzaremos:

source: Again, this will cause a `git push origin` to push the local `master` branch to the remote `qa/master` branch by default.
es: Esto hará que un simple comando `git push origin` envie por defecto la rama local `master` a la rama remota `qa/master`,

source: The main drawback to this approach is that it can be very slow and is often unnecessary — if you don’t try to force the push with `-f`, the server will warn you and not accept the push.
es: La mayor pega de este sistema es el que puede llegar a ser muy lento; y muchas veces es innecesario, ya que el propio servidor te va a avisar y te impedirá el envio, siempre y cuando no intentes forzar dicho envio con la opción '-f'.

source: John’s initial repository.
es: El repositorio inicial de John.

source: The project maintainer pushes to their public repository.
es: La persona gestora del proyecto envia (push) a su repositorio público (repositorio principal).

source: This goes through and rewrites every commit to have your new address.
es: Este comando pasa por todo el repositorio y reescribe cada confirmación de cambios donde detecte la dirección de correo indicada, para reemplazarla por la nueva.

source: The Git project has four long-running branches: `master`, `next`, and `pu` (proposed updates) for new work, and `maint` for maintenance backports.
es: El proyecto Git tiene cuatro ramas de largo recorrido: 'master', 'next', 'pu' (proposed updates) para el trabajo nuevo, y 'maint' (maintenance) para trabajos de mantenimiento de versiones previas.

source: If you’re describing a commit that you have directly tagged, it gives you the tag name.
es: Si solicitas descripción de una confirmación de cambios (commit) etiquetada directamente con su propia etiqueta particular, obtendrás dicha etiqueta como descripción.

source: It’s time to e-mail your mailing list of people who want to know what’s happening in your project.
es: Ya va siendo hora de enviar un mensaje a tu lista de correo, informando a las personas que desean conocer la marcha de tu proyecto.

source: Next you can create a new repository.
es: A continuación, puedes crear nuevos repositorios.
